## Plan Result (883: prod_ai - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.ai.azurerm_machine_learning_compute_instance.compute_instance[0]
  * module.ai.azurerm_role_assignment.blob_contributor_from_compute_instance[0]
  * module.ai.azurerm_role_assignment.sa_contributor_from_compute_instance[0]
* Update
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.storage.azurerm_storage_account.storage_account
* Delete
  * module.ai.azurerm_machine_learning_compute_cluster.compute_cluster




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-prod"
        name                           = "dlrm-ingest-ai-foundry-prod"
      ~ tags                           = {
          - "__SYSTEM__AIServices_Enda-m9gxngd8-uksouth"                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AIServices_dlrm-aria-document-migration-res"       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
          - "__SYSTEM__AzureOpenAI_Enda-m9gxngd8-uksouth_aoai"            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/Enda-m9gxngd8-uksouth" -> null
          - "__SYSTEM__AzureOpenAI_dlrm-aria-document-migration-res_aoai" = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.CognitiveServices/accounts/dlrm-aria-document-migration-res" -> null
            "application"                                                 = "dlrm-data-ingest"
            "builtFrom"                                                   = "hmcts/dlrm-data-ingest-infra"
            "businessArea"                                                = "cross-cutting"
            "criticality"                                                 = "High"
            "environment"                                                 = "production"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_machine_learning_compute_cluster.compute_cluster will be destroyed
  # (because azurerm_machine_learning_compute_cluster.compute_cluster is not in configuration)
  - resource "azurerm_machine_learning_compute_cluster" "compute_cluster" {
      - id                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod/computes/dlrm-ingest-compute-cluster-prod" -> null
      - local_auth_enabled            = true -> null
      - location                      = "uksouth" -> null
      - machine_learning_workspace_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod" -> null
      - name                          = "dlrm-ingest-compute-cluster-prod" -> null
      - node_public_ip_enabled        = true -> null
      - ssh_public_access_enabled     = false -> null
      - tags                          = {} -> null
      - vm_priority                   = "LowPriority" -> null
      - vm_size                       = "Standard_DS2_v2" -> null
        # (1 unchanged attribute hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "acc14550-443d-4b32-b272-0a33096443b2" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - scale_settings {
          - max_node_count                       = 1 -> null
          - min_node_count                       = 0 -> null
          - scale_down_nodes_after_idle_duration = "PT30S" -> null
        }
    }

  # module.ai.azurerm_machine_learning_compute_instance.compute_instance[0] will be created
  + resource "azurerm_machine_learning_compute_instance" "compute_instance" {
      + authorization_type            = "personal"
      + id                            = (known after apply)
      + local_auth_enabled            = true
      + machine_learning_workspace_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-prod"
      + name                          = "dlrm-ingest-compute-prod"
      + node_public_ip_enabled        = true
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_machine_size          = "Standard_D2ds_v5"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_role_assignment.blob_contributor_from_compute_instance[0] will be created
  + resource "azurerm_role_assignment" "blob_contributor_from_compute_instance" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.sa_contributor_from_compute_instance[0] will be created
  + resource "azurerm_role_assignment" "sa_contributor_from_compute_instance" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/dlrm-ingest-ai-prod/providers/Microsoft.Storage/storageAccounts/dlrmingestaisaprod"
        name                               = "dlrmingestaisaprod"
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":98,"Program":"tfcmt","SHA1":"","Target":"883: prod_ai - TerraformPlanApply","Vars":{}} -->